In [1]:
import pandas as pd

In [4]:
dict1 = {'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
         'Marks':[98,89,99,87,90,83,99],
         'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
    
}

df1 = pd.DataFrame(dict1)
display(df1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 1. Display Top 3 Rows of The Dataset

In [7]:
display(df1.head(3))

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 2. Check Last 3 Rows of The Dataset

In [8]:
display(df1.tail(3))

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 3. Find Shape of Our Dataset (# of rows and # of columns)

In [17]:
print('# of Rows:', df1.shape[0])
print('# of Columns:',df1.shape[1])

# of Rows: 7
# of Columns: 3

# 4. Get Information About Our Dataset Like Total Number of Rows, Total Number of Columns, Datatypes of each Columns And Memory Requirements

In [18]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# 5. Check Null Values In The Dataset

In [22]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

# 6. Get Overall Statistics About The Dataframe

In [26]:
df1.describe(include='all')

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Mittal        NaN  Female
freq         1        NaN       4
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

# 7. Find Unique Values From The Gender Columns

In [32]:
df1['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [33]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [35]:
df1['Gender'].nunique()

2

# 8. Display Count of Unique Values In Gender Column

In [38]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

# 10. Find Total Number of Students Having Marks Between 90 To 100 (Inclusive) Using Between Method

In [55]:
len(df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)])

4

In [59]:
df1['Marks'].between(90,100).sum()

4

# 11. Find Average Marks

In [62]:
df1['Marks'].sum()/len(df1)

92.14285714285714

In [64]:
df1['Marks'].mean()

92.14285714285714

# 12. Apply Method

In [82]:
def marks(x):
    return x/2

In [83]:
#Udf in apply method
df1['Half_Marks'] = df1['Marks'].apply(marks)

In [84]:
#lambda function in apply method
df1['Quarter_Marks'] = df1['Marks'].apply(lambda x:x/4)

In [85]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           7 non-null      object
 1   Marks          7 non-null      int64
 2   Gender         7 non-null      object
 3   Half_Marks     7 non-null      float64
 4   Quarter_Marks  7 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 408.0+ bytes

In [87]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# 13. Map Function

In [91]:
df1['Sex'] = df1['Gender'].map({'Male':1,'Female':0})

In [93]:
df1

      Name  Marks  Gender  Half_Marks  Quarter_Marks  Sex
0  Priyang     98    Male        49.0          24.50    1
1   Aadhya     89  Female        44.5          22.25    0
2   Krisha     99  Female        49.5          24.75    0
3   Vedant     87    Male        43.5          21.75    1
4   Parshv     90    Male        45.0          22.50    1
5   Mittal     83  Female        41.5          20.75    0
6  Archana     99  Female        49.5          24.75    0

# 14. Drop the Columns(s)

In [97]:
df1.drop('Half_Marks',axis=1)

      Name  Marks  Gender  Quarter_Marks  Sex
0  Priyang     98    Male          24.50    1
1   Aadhya     89  Female          22.25    0
2   Krisha     99  Female          24.75    0
3   Vedant     87    Male          21.75    1
4   Parshv     90    Male          22.50    1
5   Mittal     83  Female          20.75    0
6  Archana     99  Female          24.75    0

In [100]:
df1.drop(['Half_Marks','Quarter_Marks'],axis=1,inplace=True)

KeyError: "['Half_Marks' 'Quarter_Marks'] not found in axis"

In [102]:
df1

      Name  Marks  Gender  Sex
0  Priyang     98    Male    1
1   Aadhya     89  Female    0
2   Krisha     99  Female    0
3   Vedant     87    Male    1
4   Parshv     90    Male    1
5   Mittal     83  Female    0
6  Archana     99  Female    0

# 15. Print Name of the Columns

In [105]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Sex'], dtype='object')

In [106]:
df1.index

RangeIndex(start=0, stop=7, step=1)

# 16. Sort The Dataframe As Per The Marks Column

In [111]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender  Sex
2   Krisha     99  Female    0
6  Archana     99  Female    0
0  Priyang     98    Male    1
4   Parshv     90    Male    1
1   Aadhya     89  Female    0
3   Vedant     87    Male    1
5   Mittal     83  Female    0

In [120]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [124]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99